# LoopFace Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
HostObjectSubcomponentInfo..::..LoopFace Property
HostObjectSubcomponentInfo Class See Also
---
The face of the loops of the roof or floor slab.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public Face LoopFace { get; }
```

Visual Basic
---
```text
Public ReadOnly Property LoopFace As Face
	Get
```

Visual C++
---
```text
public:
property Face^ LoopFace {
	Face^ get ();
}
```

# See Also
HostObjectSubcomponentInfo Class
Autodesk.Revit.DB.IFC Namespace